public_html/raspberry_instalacion.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-03-20 vie 13:37 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Raspberry - Instalación</title>
<meta name="author" content="Sherlockes" />
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' type='text/css' href='https://gongzhitaao.org/orgcss/org.css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Raspberry - Instalación</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org9bb5e2d">1. Instalando PI OS Lite</a>
<ul>
<li><a href="#orgcda0547">1.1. Grabar la imagen mediante Imager y actualizar el sistema.</a></li>
<li><a href="#org5bc44a0">1.2. Generar la llave ssh</a></li>
<li><a href="#org473d5ea">1.3. Copiar la llave ssh a Github y GitLab.</a></li>
<li><a href="#org51271e3">1.4. Instalar y configurar git</a></li>
<li><a href="#orgc43755e">1.5. Clonar SherloScripts</a></li>
<li><a href="#org8b239ce">1.6. Open Network Manager UI with para asignar ip estática</a></li>
<li><a href="#orgeb948ff">1.7. Instalar Pi-Hole</a></li>
<li><a href="#org9fd8821">1.8. Instalar Rclone (Web).</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Partimos con la <a href="raspberry.html#ID-d3201961-966d-4371-ae48-5dbcab004573">raspberry</a> vacía y estos son los pasos que hay que dar. He probado a hacer un script que con el paso del tiempo siempre falla en un punto u otro, así quedan las instrucciones claras.
</p>

<div id="outline-container-org9bb5e2d" class="outline-2">
<h2 id="org9bb5e2d"><span class="section-number-2">1.</span> Instalando PI OS Lite</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgcda0547" class="outline-3">
<h3 id="orgcda0547"><span class="section-number-3">1.1.</span> Grabar la imagen mediante <a href="https://www.raspberrypi.com/software/">Imager</a> y actualizar el sistema.</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-bash">sudo apt update
sudo apt upgrade
</pre>
</div>
</div>
</div>
<div id="outline-container-org5bc44a0" class="outline-3">
<h3 id="org5bc44a0"><span class="section-number-3">1.2.</span> Generar la llave ssh</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-bash">ssh-keygen
</pre>
</div>
</div>
</div>
<div id="outline-container-org473d5ea" class="outline-3">
<h3 id="org473d5ea"><span class="section-number-3">1.3.</span> Copiar la llave ssh a <a href="https://github.com/settings/keys">Github</a> y <a href="https://gitlab.com/-/profile/keys">GitLab</a>.</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Abrir el archivo ".ssh/id<sub>rsa.pub</sub>" con un editor de texto y copiar el contenido.
</p>
</div>
</div>
<div id="outline-container-org51271e3" class="outline-3">
<h3 id="org51271e3"><span class="section-number-3">1.4.</span> Instalar y configurar git</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">
<pre class="src src-bash">sudo apt install git
git config --global user.email <span style="color: #95e454;">"sherlockes@yahoo.es"</span>
git config --global user.name <span style="color: #95e454;">"Sherlockes"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc43755e" class="outline-3">
<h3 id="orgc43755e"><span class="section-number-3">1.5.</span> Clonar SherloScripts</h3>
<div class="outline-text-3" id="text-1-5">
<div class="org-src-container">
<pre class="src src-bash">git clone git@github.com:sherlockes/SherloScripts.git
</pre>
</div>
</div>
</div>
<div id="outline-container-org8b239ce" class="outline-3">
<h3 id="org8b239ce"><span class="section-number-3">1.6.</span> Open Network Manager UI with para asignar ip estática</h3>
<div class="outline-text-3" id="text-1-6">
<div class="org-src-container">
<pre class="src src-bash">sudo nmtui
</pre>
</div>
</div>
</div>
<div id="outline-container-orgeb948ff" class="outline-3">
<h3 id="orgeb948ff"><span class="section-number-3">1.7.</span> Instalar Pi-Hole</h3>
<div class="outline-text-3" id="text-1-7">
<div class="org-src-container">
<pre class="src src-bash">curl -sSL https://install.pi-hole.net | bash
</pre>
</div>
</div>
</div>
<div id="outline-container-org9fd8821" class="outline-3">
<h3 id="org9fd8821"><span class="section-number-3">1.8.</span> Instalar Rclone (<a href="https://rclone.org">Web</a>).</h3>
<div class="outline-text-3" id="text-1-8">
<div class="org-src-container">
<pre class="src src-bash">sudo -v ; curl https://rclone.org/install.sh | sudo bash
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2023-12-15</p>
<p class="author">Author: Sherlockes</p>
<p class="date">Created: 2026-03-20 vie 13:37</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
